src/Enums/СтатусыКассовойСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКассовойСмены</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытаЧекиЗаархивированы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КассоваяСмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>КассоваяСмена</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеКассовойСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусыКассовойСмены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/РозничныеПродажиКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Выполнить контроль использования кассовой смены
//
// Параметры:
//  Форма								 - 	 - 
//  Касса								 - 	 - 
//  ПараметрыИспользованияКассовойСмены	 - 	 - 
//  ОписаниеОшибки						 - 	 - 
//
Процедура ВыполнитьКонтрольИспользованияКассовойСмены(Форма, Касса, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки = "", РазрешитьОткрытиеКСЕслиОнаЗакрыта = Истина) Экспорт
	
	// Проверяем необходимость использвования кассовой смены для тек. финансовой операции
	Если РозничныеПродажи.ДоступностьИспользованияКассовойСмены(Касса) = Ложь Тогда
		
		РезОперации = Истина;
		Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
		
	Иначе 
		
		РезОперации = Ложь;
		СостояниеТекущейКС = РозничныеПродажи.ПолучитьСостояниеКассовойСмены(Касса);	
		
		// Если необходимо, открываем кассовую смену
		Если СостояниеТекущейКС = Неопределено 
			ИЛИ СостояниеТекущейКС.СтатусыКассовойСмены = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Закрыта") Тогда
			
			Если РазрешитьОткрытиеКСЕслиОнаЗакрыта = Истина Тогда
				
				РезОперации = РозничныеПродажи.ОткрытьКассовуюСмену(Касса, ОписаниеОшибки);
				Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
				
			Иначе
				
				ОписаниеОшибки = НСтр("ru='Кассовая смена закрыта';en='Cash change isclosed'");
				Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
				
			КонецЕсли;
			
		ИначеЕсли СостояниеТекущейКС <> Неопределено 
			И СостояниеТекущейКС.СтатусыКассовойСмены = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта") Тогда
			
			ВремяСМоментаОткрытия = ТекущаяДата() - СостояниеТекущейКС.НачалоКассовойСмены;
			Если ВремяСМоментаОткрытия >= 86400 Тогда		
				
				//Результат      = Ложь;
				ОписаниеОшибки = НСтр("ru='С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены.';
					|en='Since discoveries cash register shifts expired more 24 hours. Required run closing cash shifts.'");
				
				// Формируем параметры вопроса
				СтруктураОповещения = Новый Структура("Форма, Касса, СостояниеТекущейКС, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки",
					Форма, Касса, СостояниеТекущейКС, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
				ОписаниеОповещенияОНеобходимостиЗакрытияКассовойСмены = Новый ОписаниеОповещения("ПослеВопросаОНеобходимостиЗакрытияКассовойСмены", РозничныеПродажиКлиент, СтруктураОповещения);
				ТекстВопроса = НСтр("ru='С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены. Продолжить?';
				|en='Since discoveries cash register shifts expired more 24 hours. Required run closing cash register shifts. Continue?'");
				
				// Задаем вопрос
				ПоказатьВопрос(ОписаниеОповещенияОНеобходимостиЗакрытияКассовойСмены, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , НСтр("ru= 'Внимание';en = 'Attention'"));
				
			Иначе
				
				РезОперации = Истина;
				Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ПараметрыИспользованияКассовойСмены, ОписаниеОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - После вопроса о необходимости закрытия кассовой смены
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеВопросаОНеобходимостиЗакрытияКассовойСмены(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещенияПослеЗакрытияФормыУправленияКасовойСмены = Новый ОписаниеОповещения("ПослеЗакрытияФормыУправленияКассовойСменой", РозничныеПродажиКлиент, ДополнительныеПараметры);
		ОткрытьФорму("Документ.КассоваяСмена.Форма.ФормаУправленияКассовойСменой",		
						Новый Структура("КассоваяСмена", ДополнительныеПараметры.СостояниеТекущейКС.КассоваяСмена),,,,,
						ОписаниеОповещенияПослеЗакрытияФормыУправленияКасовойСмены);
	Иначе 
		РезОперации = Ложь;
		ДополнительныеПараметры.Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ДополнительныеПараметры.ПараметрыИспользованияКассовойСмены, ДополнительныеПараметры.ОписаниеОшибки);
	КонецЕсли;			
	
КонецПроцедуры

// Процедура - После закрытия формы управления кассовой сменой
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПослеЗакрытияФормыУправленияКассовойСменой(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		РезОперации = РозничныеПродажи.ОткрытьКассовуюСмену(ДополнительныеПараметры.Касса, ДополнительныеПараметры.ОписаниеОшибки);
		ДополнительныеПараметры.Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ДополнительныеПараметры.ПараметрыИспользованияКассовойСмены, ДополнительныеПараметры.ОписаниеОшибки);
	Иначе 
		РезОперации = Ложь;
		ДополнительныеПараметры.Форма.ПослеКонтроляИспользованияКассовойСмены(РезОперации, ДополнительныеПараметры.ПараметрыИспользованияКассовойСмены, ДополнительныеПараметры.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
